In [1]:
import numpy as np
import pandas as pd

In [1]:
def variance(nums):
    x_bar=sum(nums)/len(nums)
    temp=0
    for i in nums:
        distance=(i-x_bar)**2
        temp+=distance
    return temp/len(nums)

In [3]:
l=[-5,0,5,15,10]
variance(l)

50.0

In [9]:
l=np.array(l)
l.mean()

np.float64(5.0)

In [2]:
df=pd.read_csv('file.csv')

In [17]:
df.tail()

    Length  Width   City    Price
6        5     30  Luxor   500000
7        7     20  Aswan   700000
8        2     40   Alex  9000000
9        8     20  Cairo   900000
10       6     14   Giza  6000000

In [18]:
df.head()

   Length  Width   City    Price
0      20     10  Cairo   500000
1      15     15   Alex   400000
2      30     20  Aswan  1500000
3      10     50   Alex  8000000
4       5     15   Giza   800000

In [22]:
df['City']

0     Cairo
1      Alex
2     Aswan
3      Alex
4      Giza
5      Alex
6     Luxor
7     Aswan
8      Alex
9     Cairo
10     Giza
Name: City, dtype: object

In [24]:
df['Length'].mean()

np.float64(10.909090909090908)

In [25]:
df['Length'].median()

np.float64(8.0)

In [30]:
df['Length']

0     20
1     15
2     30
3     10
4      5
5     12
6      5
7      7
8      2
9      8
10     6
Name: Length, dtype: int64

In [34]:
print(df.head())
df.tail()

   Length  Width   City    Price
0      20     10  Cairo   500000
1      15     15   Alex   400000
2      30     20  Aswan  1500000
3      10     50   Alex  8000000
4       5     15   Giza   800000

    Length  Width   City    Price
6        5     30  Luxor   500000
7        7     20  Aswan   700000
8        2     40   Alex  9000000
9        8     20  Cairo   900000
10       6     14   Giza  6000000

In [35]:
df['Length'].std()

np.float64(8.141922935701928)

In [3]:
df['Length'].var()

np.float64(66.29090909090908)

In [11]:
Q1=df['Length'].quantile(.25)
Q2=df['Length'].median()
Q3=df['Length'].quantile(.75)

In [12]:
IQR=Q3-Q1

In [14]:
Q1

np.float64(5.5)

In [15]:
df['Length']

0     20
1     15
2     30
3     10
4      5
5     12
6      5
7      7
8      2
9      8
10     6
Name: Length, dtype: int64

In [17]:
df.sort_values('Length')['Length']

8      2
6      5
4      5
10     6
7      7
9      8
3     10
5     12
1     15
0     20
2     30
Name: Length, dtype: int64

In [24]:
df['Length'].sort_values()

8      2
6      5
4      5
10     6
7      7
9      8
3     10
5     12
1     15
0     20
2     30
Name: Length, dtype: int64

In [28]:
df.select_dtypes('number').corr()

          Length     Width     Price
Length  1.000000 -0.315013 -0.350141
Width  -0.315013  1.000000  0.721231
Price  -0.350141  0.721231  1.000000

In [29]:
df.head(2)

   Length  Width   City   Price
0      20     10  Cairo  500000
1      15     15   Alex  400000

In [30]:
df.head()

   Length  Width   City    Price
0      20     10  Cairo   500000
1      15     15   Alex   400000
2      30     20  Aswan  1500000
3      10     50   Alex  8000000
4       5     15   Giza   800000

In [31]:
df.dtypes

Length     int64
Width      int64
City      object
Price      int64
dtype: object

In [32]:
df['City']=df['City'].astype('category')

In [33]:
df.dtypes

Length       int64
Width        int64
City      category
Price        int64
dtype: object

In [34]:
df.head()

   Length  Width   City    Price
0      20     10  Cairo   500000
1      15     15   Alex   400000
2      30     20  Aswan  1500000
3      10     50   Alex  8000000
4       5     15   Giza   800000

In [35]:
sub_df=df[['Length','Width']]

In [40]:
sub_df[cols]=sub_df[cols].astype('float')

C:\Users\HP Zbook Fury 15 G7\AppData\Local\Temp\ipykernel_23724\1857277096.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sub_df[cols]=sub_df[cols].astype('float')

In [37]:
cols=['Length','Width']

In [38]:
sub2=df[cols]

In [42]:
sub_df.dtypes

Length    float64
Width     float64
dtype: object

In [44]:
df.describe()

          Length      Width         Price
count  11.000000  11.000000  1.100000e+01
mean   10.909091  22.181818  2.663636e+06
std     8.141923  12.781379  3.298567e+06
min     2.000000  10.000000  4.000000e+05
25%     5.500000  14.500000  6.000000e+05
50%     8.000000  20.000000  9.000000e+05
75%    13.500000  25.000000  3.750000e+06
max    30.000000  50.000000  9.000000e+06

In [45]:
df.describe(include='category')

        City
count     11
unique     5
top     Alex
freq       4

In [46]:
df['City']

0     Cairo
1      Alex
2     Aswan
3      Alex
4      Giza
5      Alex
6     Luxor
7     Aswan
8      Alex
9     Cairo
10     Giza
Name: City, dtype: category
Categories (5, object): ['Alex', 'Aswan', 'Cairo', 'Giza', 'Luxor']

In [52]:
s=df['City'].value_counts()

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Length  11 non-null     int64
 1   Width   11 non-null     int64
 2   City    11 non-null     category
 3   Price   11 non-null     int64
dtypes: category(1), int64(3)
memory usage: 619.0 bytes

In [58]:
df.max(numeric_only=True)

Length         30
Width          50
Price     9000000
dtype: int64

In [3]:
df['Length'].values

array([20, 15, 30, 10,  5, 12,  5,  7,  2,  8,  6])

In [4]:
df.values

array([[20, 10, 'Cairo', 500000],
       [15, 15, 'Alex', 400000],
       [30, 20, 'Aswan', 1500000],
       [10, 50, 'Alex', 8000000],
       [5, 15, 'Giza', 800000],
       [12, 10, 'Alex', 1000000],
       [5, 30, 'Luxor', 500000],
       [7, 20, 'Aswan', 700000],
       [2, 40, 'Alex', 9000000],
       [8, 20, 'Cairo', 900000],
       [6, 14, 'Giza', 6000000]], dtype=object)

In [6]:
df.head(2)

   Length  Width   City   Price
0      20     10  Cairo  500000
1      15     15   Alex  400000

In [9]:
df2=df.replace("Cairo","USA")

In [8]:
df.head(2)

   Length  Width   City   Price
0      20     10  Cairo  500000
1      15     15   Alex  400000

In [16]:
df.replace("Cairo","USA",inplace=True)

In [20]:
df=pd.read_csv('file.csv')

In [21]:
df2.head(2)

   Length  Width  City   Price
0      20     10   USA  500000
1      15     15  Alex  400000

In [22]:
df.replace({'Cairo':'USA','Alex':'France'})

    Length  Width    City    Price
0       20     10     USA   500000
1       15     15  France   400000
2       30     20   Aswan  1500000
3       10     50  France  8000000
4        5     15    Giza   800000
5       12     10  France  1000000
6        5     30   Luxor   500000
7        7     20   Aswan   700000
8        2     40  France  9000000
9        8     20     USA   900000
10       6     14    Giza  6000000

In [23]:
df.replace(['Alex','Cairo','Giza'],'Egypt')

    Length  Width   City    Price
0       20     10  Egypt   500000
1       15     15  Egypt   400000
2       30     20  Aswan  1500000
3       10     50  Egypt  8000000
4        5     15  Egypt   800000
5       12     10  Egypt  1000000
6        5     30  Luxor   500000
7        7     20  Aswan   700000
8        2     40  Egypt  9000000
9        8     20  Egypt   900000
10       6     14  Egypt  6000000

In [24]:
df.head(2)

   Length  Width   City   Price
0      20     10  Cairo  500000
1      15     15   Alex  400000

In [29]:
df['new']=1

In [30]:
df['new']=df['new'].map({1:'one'})

In [31]:
df.head()

   Length  Width   City    Price  new
0      20     10  Cairo   500000  one
1      15     15   Alex   400000  one
2      30     20  Aswan  1500000  one
3      10     50   Alex  8000000  one
4       5     15   Giza   800000  one

In [32]:
df.sort_values('City')

    Length  Width   City    Price  new
1       15     15   Alex   400000  one
3       10     50   Alex  8000000  one
5       12     10   Alex  1000000  one
8        2     40   Alex  9000000  one
2       30     20  Aswan  1500000  one
7        7     20  Aswan   700000  one
0       20     10  Cairo   500000  one
9        8     20  Cairo   900000  one
4        5     15   Giza   800000  one
10       6     14   Giza  6000000  one
6        5     30  Luxor   500000  one

In [38]:
df.sort_values('City',ascending=False)

    Length  Width   City    Price  new
6        5     30  Luxor   500000  one
4        5     15   Giza   800000  one
10       6     14   Giza  6000000  one
0       20     10  Cairo   500000  one
9        8     20  Cairo   900000  one
2       30     20  Aswan  1500000  one
7        7     20  Aswan   700000  one
1       15     15   Alex   400000  one
3       10     50   Alex  8000000  one
5       12     10   Alex  1000000  one
8        2     40   Alex  9000000  one

In [39]:
def duplicate(x):
    return x*2

In [49]:
df['new']=df['Width'].apply(duplicate)

In [53]:
def lower(x):
    return x.lower()

In [60]:
df['City'].apply(lower)

0     cairo
1      alex
2     aswan
3      alex
4      giza
5      alex
6     luxor
7     aswan
8      alex
9     cairo
10     giza
Name: City, dtype: object

In [46]:
len()

4

In [52]:
'ssss'.lower()

'ssss'

In [57]:
f=lambda x:print(x.upper())

In [59]:
f('abc')

ABC

In [61]:
def g(x):
    print(x.upper())

In [62]:
df.drop('new',axis=1,inplace=True)

In [63]:
df.head()

   Length  Width   City    Price
0      20     10  Cairo   500000
1      15     15   Alex   400000
2      30     20  Aswan  1500000
3      10     50   Alex  8000000
4       5     15   Giza   800000

In [65]:
l={'Length':11,'Width':545,'City':'SSS','Price':55555}

In [70]:
df._append(l,ignore_index=True)

    Length  Width   City    Price
0       20     10  Cairo   500000
1       15     15   Alex   400000
2       30     20  Aswan  1500000
3       10     50   Alex  8000000
4        5     15   Giza   800000
5       12     10   Alex  1000000
6        5     30  Luxor   500000
7        7     20  Aswan   700000
8        2     40   Alex  9000000
9        8     20  Cairo   900000
10       6     14   Giza  6000000
11      11    545    SSS    55555

In [71]:
df.drop??

Signature:
df.drop(
    labels: 'IndexLabel | None' = None,
    *,
    axis: 'Axis' = 0,
    index: 'IndexLabel | None' = None,
    columns: 'IndexLabel | None' = None,
    level: 'Level | None' = None,
    inplace: 'bool' = False,
    errors: 'IgnoreRaise' = 'raise',
) -> 'DataFrame | None'
Source:
    def drop(
        self,
        labels: IndexLabel | None = None,
        *,
        axis: Axis = 0,
        index: IndexLabel | None = None,
        columns: IndexLabel | None = None,
        level: Level | None = None,
        inplace: bool = False,
        errors: IgnoreRaise = "raise",
    ) -> DataFrame | None:
        """
        Drop specified labels from rows or columns.

        Remove rows or columns by specifying label names and corresponding
        axis, or by directly specifying index or column names. When using a
        multi-index, labels on different levels can be removed by specifying
        the level. See the :ref:`user guide <advanced.shown_levels>`
        for more information about the now unused levels.

        Parameters
        ----------
        labels : single label or list-like
            Index or column labels to drop. A tuple will be used as a single
            label and not treated as a list-like.
        axis : {0 or 'index', 1 or 'columns'}, default 0
            Whether to drop labels from the index (0 or 'index') or
            columns (1 or 'columns').
        index : single label or list-like
            Alternative to specifying axis (``labels, axis=0``
            is equivalent to ``index=labels``).
        columns : single label or list-like
            Alternative to specifying axis (``labels, axis=1``
            is equivalent to ``columns=labels``).
        level : int or level name, optional
            For MultiIndex, level from which the labels will be removed.
        inplace : bool, default False
            If False, return a copy. Otherwise, do operation
            in place and return None.
        errors : {'ignore', 'raise'}, default 'raise'
            If 'ignore', suppress error and only existing labels are
            dropped.

        Returns
        -------
        DataFrame or None
            Returns DataFrame or None DataFrame with the specified
            index or column labels removed or None if inplace=True.

        Raises
        ------
        KeyError
            If any of the labels is not found in the selected axis.

        See Also
        --------
        DataFrame.loc : Label-location based indexer for selection by label.
        DataFrame.dropna : Return DataFrame with labels on given axis omitted
            where (all or any) data are missing.
        DataFrame.drop_duplicates : Return DataFrame with duplicate rows
            removed, optionally only considering certain columns.
        Series.drop : Return Series with specified index labels removed.

        Examples
        --------
        >>> df = pd.DataFrame(np.arange(12).reshape(3, 4),
        ...                   columns=['A', 'B', 'C', 'D'])
        >>> df
           A  B   C   D
        0  0  1   2   3
        1  4  5   6   7
        2  8  9  10  11

        Drop columns

        >>> df.drop(['B', 'C'], axis=1)
           A   D
        0  0   3
        1  4   7
        2  8  11

        >>> df.drop(columns=['B', 'C'])
           A   D
        0  0   3
        1  4   7
        2  8  11

        Drop a row by index

        >>> df.drop([0, 1])
           A  B   C   D
        2  8  9  10  11

        Drop columns and/or rows of MultiIndex DataFrame

        >>> midx = pd.MultiIndex(levels=[['llama', 'cow', 'falcon'],
        ...                              ['speed', 'weight', 'length']],
        ...                      codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2],
        ...                             [0, 1, 2, 0, 1, 2, 0, 1, 2]])
        >>> df = pd.DataFrame(index=midx, columns=['big', 'small'],
        ...                   data=[[45, 30], [200, 100], [1.5, 1], [30, 20],
        ...                         [250, 150], [1.5, 0.8], [320, 250],
        ...                         [1, 0.8], [0.3, 0.2]])
        >>> df
                        big     small
        llama   speed   45.0    30.0
                weight  200.0   100.0
                length  1.5     1.0
        cow     speed   30.0    20.0
                weight  250.0   150.0
                length  1.5     0.8
        falcon  speed   320.0   250.0
                weight  1.0     0.8
                length  0.3     0.2

        Drop a specific index combination from the MultiIndex
        DataFrame, i.e., drop the combination ``'falcon'`` and
        ``'weight'``, which deletes only the corresponding row

        >>> df.drop(index=('falcon', 'weight'))
                        big     small
        llama   speed   45.0    30.0
                weight  200.0   100.0
                length  1.5     1.0
        cow     speed   30.0    20.0
                weight  250.0   150.0
                length  1.5     0.8
        falcon  speed   320.0   250.0
                length  0.3     0.2

        >>> df.drop(index='cow', columns='small')
                        big
        llama   speed   45.0
                weight  200.0
                length  1.5
        falcon  speed   320.0
                weight  1.0
                length  0.3

        >>> df.drop(index='length', level=1)
                        big     small
        llama   speed   45.0    30.0
                weight  200.0   100.0
        cow     speed   30.0    20.0
                weight  250.0   150.0
        falcon  speed   320.0   250.0
                weight  1.0     0.8
        """
        return super().drop(
            labels=labels,
            axis=axis,
            index=index,
            columns=columns,
            level=level,
            inplace=inplace,
            errors=errors,
        )
File:      c:\users\hp zbook fury 15 g7\appdata\local\programs\python\python313\lib\site-packages\pandas\core\frame.py
Type:      method

In [81]:
df.drop(2).reset_index().drop(columns=['index'])

   Length  Width   City    Price
0      20     10  Cairo   500000
1      15     15   Alex   400000
2      10     50   Alex  8000000
3       5     15   Giza   800000
4      12     10   Alex  1000000
5       5     30  Luxor   500000
6       7     20  Aswan   700000
7       2     40   Alex  9000000
8       8     20  Cairo   900000
9       6     14   Giza  6000000

In [75]:
df.head()

   Length  Width   City    Price
0      20     10  Cairo   500000
1      15     15   Alex   400000
2      30     20  Aswan  1500000
3      10     50   Alex  8000000
4       5     15   Giza   800000

In [93]:
pd.DataFrame(df.isnull().sum()).T

   Length  Width  City  Price
0       0      0     0      0